## Verisetlerini Birleştirmek

.concat

.merge()

In [3]:
import pandas as pd
import numpy as np

## .concat()

In [5]:
AB = {
    "A" : ["A0","A1","A2","A3"],
    "B" : ["B0","B1","B2","B3"]
}

In [6]:
CD = {
    "C" : ["C0","C1","C2","C3"],
    "D" : ["D0","D1","D2","D3"]
}

In [7]:
AB

{'A': ['A0', 'A1', 'A2', 'A3'], 'B': ['B0', 'B1', 'B2', 'B3']}

In [8]:
df_AB = pd.DataFrame(AB)
df_CD = pd.DataFrame(CD)

In [9]:
df_AB

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [10]:
df_CD

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [11]:
help(pd.concat)

Help on function concat in module pandas.core.reshape.concat:

concat(objs: 'Iterable[NDFrame] | Mapping[HashableT, NDFrame]', *, axis: 'Axis' = 0, join: 'str' = 'outer', ignore_index: 'bool' = False, keys=None, levels=None, names=None, verify_integrity: 'bool' = False, sort: 'bool' = False, copy: 'bool' = True) -> 'DataFrame | Series'
    Concatenate pandas objects along a particular axis.

    Allows optional set logic along the other axes.

    Can also add a layer of hierarchical indexing on the concatenation axis,
    which may be useful if the labels are the same (or overlapping) on
    the passed axis number.

    Parameters
    ----------
    objs : a sequence or mapping of Series or DataFrame objects
        If a mapping is passed, the sorted keys will be used as the `keys`
        argument, unless it is passed, in which case the values will be
        selected (see below). Any None objects will be dropped silently unless
        they are all None in which case a ValueError will be raised.
    axis : {0/'index', 1/'columns'}, default 0
        The axis to concatenate along.
    join : {'inner', 'outer'}, default 'outer'
        How to handle indexes on other axis (or axes).
    ignore_index : bool, default False
        If True, do not use the index values along the concatenation axis. The
        resulting axis will be labeled 0, ..., n - 1. This is useful if you are
        concatenating objects where the concatenation axis does not have
        meaningful indexing information. Note the index values on the other
        axes are still respected in the join.
    keys : sequence, default None
        If multiple levels passed, should contain tuples. Construct
        hierarchical index using the passed keys as the outermost level.
    levels : list of sequences, default None
        Specific levels (unique values) to use for constructing a
        MultiIndex. Otherwise they will be inferred from the keys.
    names : list, default None
        Names for the levels in the resulting hierarchical index.
    verify_integrity : bool, default False
        Check whether the new concatenated axis contains duplicates. This can
        be very expensive relative to the actual data concatenation.
    sort : bool, default False
        Sort non-concatenation axis if it is not already aligned when `join`
        is 'outer'.
        This has no effect when ``join='inner'``, which already preserves
        the order of the non-concatenation axis.

        .. versionchanged:: 1.0.0

           Changed to not sort by default.

    copy : bool, default True
        If False, do not copy data unnecessarily.

    Returns
    -------
    object, type of objs
        When concatenating all ``Series`` along the index (axis=0), a
        ``Series`` is returned. When ``objs`` contains at least one
        ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
        the columns (axis=1), a ``DataFrame`` is returned.

    See Also
    --------
    DataFrame.join : Join DataFrames using indexes.
    DataFrame.merge : Merge DataFrames by indexes or columns.

    Notes
    -----
    The keys, levels, and names arguments are all optional.

    A walkthrough of how this method fits in with other tools for combining
    pandas objects can be found `here
    <https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

    It is not recommended to build DataFrames by adding single rows in a
    for loop. Build a list of rows and make a DataFrame in a single concat.

    Examples
    --------
    Combine two ``Series``.

    >>> s1 = pd.Series(['a', 'b'])
    >>> s2 = pd.Series(['c', 'd'])
    >>> pd.concat([s1, s2])
    0    a
    1    b
    0    c
    1    d
    dtype: object

    Clear the existing index and reset it in the result
    by setting the ``ignore_index`` option to ``True``.

    >>> pd.concat([s1, s2], ignore_index=True)
    0    a
    1    b
    2    c
    3    d
    dtype: object

    Add a hierarchical index at the outermost level of
    the data with the ``keys`` option.

    >>> pd.concat([s1, s2], keys=['s1', 's2'])
    s1  0    a
        1    b
    s2  0    c
        1    d
    dtype: object

    Label the index keys you create with the ``names`` option.

    >>> pd.concat([s1, s2], keys=['s1', 's2'],
    ...           names=['Series name', 'Row ID'])
    Series name  Row ID
    s1           0         a
                 1         b
    s2           0         c
                 1         d
    dtype: object

    Combine two ``DataFrame`` objects with identical columns.

    >>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
    ...                    columns=['letter', 'number'])
    >>> df1
      letter  number
    0      a       1
    1      b       2
    >>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
    ...                    columns=['letter', 'number'])
    >>> df2
      letter  number
    0      c       3
    1      d       4
    >>> pd.concat([df1, df2])
      letter  number
    0      a       1
    1      b       2
    0      c       3
    1      d       4

    Combine ``DataFrame`` objects with overlapping columns
    and return everything. Columns outside the intersection will
    be filled with ``NaN`` values.

    >>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
    ...                    columns=['letter', 'number', 'animal'])
    >>> df3
      letter  number animal
    0      c       3    cat
    1      d       4    dog
    >>> pd.concat([df1, df3], sort=False)
      letter  number animal
    0      a       1    NaN
    1      b       2    NaN
    0      c       3    cat
    1      d       4    dog

    Combine ``DataFrame`` objects with overlapping columns
    and return only those that are shared by passing ``inner`` to
    the ``join`` keyword argument.

    >>> pd.concat([df1, df3], join="inner")
      letter  number
    0      a       1
    1      b       2
    0      c       3
    1      d       4

    Combine ``DataFrame`` objects horizontally along the x axis by
    passing in ``axis=1``.

    >>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
    ...                    columns=['animal', 'name'])
    >>> pd.concat([df1, df4], axis=1)
      letter  number  animal    name
    0      a       1    bird   polly
    1      b       2  monkey  george

    Prevent the result from including duplicate index values with the
    ``verify_integrity`` option.

    >>> df5 = pd.DataFrame([1], index=['a'])
    >>> df5
       0
    a  1
    >>> df6 = pd.DataFrame([2], index=['a'])
    >>> df6
       0
    a  2
    >>> pd.concat([df5, df6], verify_integrity=True)
    Traceback (most recent call last):
        ...
    ValueError: Indexes have overlapping values: ['a']

    Append a single row to the end of a ``DataFrame`` object.

    >>> df7 = pd.DataFrame({'a': 1, 'b': 2}, index=[0])
    >>> df7
        a   b
    0   1   2
    >>> new_row = pd.Series({'a': 3, 'b': 4})
    >>> new_row
    a    3
    b    4
    dtype: int64
    >>> pd.concat([df7, new_row.to_frame().T], ignore_index=True)
        a   b
    0   1   2
    1   3   4

In [12]:
pd.concat([df_AB,df_CD])

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [15]:
pd.concat([df_AB,df_CD],axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [16]:
df_AB.columns

Index(['A', 'B'], dtype='object')

In [17]:
df_AB.columns = df_CD.columns

In [18]:
df_AB.columns

Index(['C', 'D'], dtype='object')

In [21]:
a = 5
b = 12

In [22]:
a,b

(5, 12)

In [23]:
pd.concat([df_AB, df_CD])

    C   D
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

# .merge()

In [25]:
kayit = pd.DataFrame({
    "kayit_id" : [1,2,3,4],
    "isim" : ["Demirel","Ecevit","Erbakan","Özal"]
})

In [26]:
kayit

   kayit_id     isim
0         1  Demirel
1         2   Ecevit
2         3  Erbakan
3         4     Özal

In [27]:
giris = pd.DataFrame({
    "giris_id" : [1,2,3,4],
    "isim" : ["Çiller","Demirel","Ecevit","Yılmaz"]
})

In [28]:
pd.merge(kayit,giris)

   kayit_id     isim  giris_id
0         1  Demirel         2
1         2   Ecevit         3

In [29]:
pd.merge(kayit,giris,how="right")

   kayit_id     isim  giris_id
0       NaN   Çiller         1
1       1.0  Demirel         2
2       2.0   Ecevit         3
3       NaN   Yılmaz         4

In [30]:
pd.merge(kayit,giris,how="left")

   kayit_id     isim  giris_id
0         1  Demirel       2.0
1         2   Ecevit       3.0
2         3  Erbakan       NaN
3         4     Özal       NaN

In [31]:
pd.merge(kayit,giris,how="outer")

   kayit_id     isim  giris_id
0       1.0  Demirel       2.0
1       2.0   Ecevit       3.0
2       3.0  Erbakan       NaN
3       4.0     Özal       NaN
4       NaN   Çiller       1.0
5       NaN   Yılmaz       4.0

In [32]:
giris = giris.set_index("isim")

In [33]:
giris

         giris_id
isim
Çiller          1
Demirel         2
Ecevit          3
Yılmaz          4

In [37]:
pd.merge(giris,kayit,left_index=True,right_on="isim")

   giris_id  kayit_id     isim
0         2         1  Demirel
1         3         2   Ecevit

In [38]:
giris.reset_index()

      isim  giris_id
0   Çiller         1
1  Demirel         2
2   Ecevit         3
3   Yılmaz         4

In [39]:
kayit

   kayit_id     isim
0         1  Demirel
1         2   Ecevit
2         3  Erbakan
3         4     Özal

In [40]:
kayit.columns=["kayit_id","kayit_ismi"]

In [41]:
kayit

   kayit_id kayit_ismi
0         1    Demirel
1         2     Ecevit
2         3    Erbakan
3         4       Özal

In [43]:
pd.merge(kayit,giris,left_on="kayit_ismi",right_on="isim")

   kayit_id kayit_ismi  giris_id
0         1    Demirel         2
1         2     Ecevit         3

In [46]:
giris.reset_index(inplace=True)

In [50]:
kayit.columns = ["id","isim"]
giris.columns = ["isim","id"]

In [51]:
kayit

   id     isim
0   1  Demirel
1   2   Ecevit
2   3  Erbakan
3   4     Özal

In [52]:
giris

      isim  id
0   Çiller   1
1  Demirel   2
2   Ecevit   3
3   Yılmaz   4

In [53]:
giris

      isim  id
0   Çiller   1
1  Demirel   2
2   Ecevit   3
3   Yılmaz   4

In [54]:
pd.merge(giris,kayit,on="isim")

      isim  id_x  id_y
0  Demirel     2     1
1   Ecevit     3     2

In [55]:
pd.merge(kayit,giris)

Empty DataFrame
Columns: [id, isim]
Index: []

In [57]:
pd.merge(kayit,giris,on="isim",suffixes=("_kayit","_giris"))

   id_kayit     isim  id_giris
0         1  Demirel         2
1         2   Ecevit         3